In [1]:
import sqlite3

# Kết nối đến database
conn = sqlite3.connect("student.db")
cursor = conn.cursor()

# Tạo bảng Student
cursor.execute('''
CREATE TABLE IF NOT EXISTS Student (
    student_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    class TEXT NOT NULL,
    course_id INTEGER,
    score REAL
);
''')

# Tạo bảng Course
cursor.execute('''
CREATE TABLE IF NOT EXISTS Course (
    id INTEGER PRIMARY KEY,
    course_name TEXT NOT NULL
);
''')

# Dữ liệu mẫu cho Student
students = [
    (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7),
    (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2),
    (3, 'Pham Van Nam', 'Toan Tin', None, 7.9),
    (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2),
    (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0),
    (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5),
    (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2),
    (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8),
    (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2),
    (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0)
]

# Dữ liệu mẫu cho Course
courses = [
    (12, 'Giai tich'),
    (34, 'Thong ke'),
    (26, 'Tin hoc')
]

# Chèn dữ liệu vào bảng
cursor.executemany("INSERT OR IGNORE INTO Student VALUES (?, ?, ?, ?, ?)", students)
cursor.executemany("INSERT OR IGNORE INTO Course VALUES (?, ?)", courses)

In [2]:
cursor.execute("SELECT * FROM student;")
rows = cursor.fetchall()
for row in rows: 
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0)

In [3]:
# Dữ liệu mẫu cho Course
courses = [
    (12, 'Giai tich'),
    (34, 'Thong ke'),
    (26, 'Tin hoc')
]

# Chèn dữ liệu vào bảng
cursor.executemany("INSERT OR IGNORE INTO Student VALUES (?, ?, ?, ?, ?)", students)
cursor.executemany("INSERT OR IGNORE INTO Course VALUES (?, ?)", courses)

Descartes

In [4]:
cursor.execute("SELECT * FROM Student, Course;")
rows = cursor.fetchall()
for row in rows: 
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin hoc')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai tich')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin hoc')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong ke')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai tich')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin hoc')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong ke')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 12, 'Giai tich')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 26, 'Tin hoc')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 34, 'Thong ke')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 12, 'Giai tich')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 26, 'Tin hoc')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 34, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai tich')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai tich')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin hoc')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong ke')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 12, 'Giai tich')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 26, 'Tin hoc')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 34, 'Thong ke')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 12, 'Giai tich')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 26, 'Tin hoc')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 34, 'Thong ke')

Inner Join

In [5]:
cursor.execute("SELECT Student.*, Course.course_name FROM Student INNER JOIN Course ON Student.course_id = Course.id;")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')

Left Join

In [6]:
cursor.execute("SELECT Student.*, Course.course_name FROM Student LEFT JOIN Course ON Student.course_id = Course.id;")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None)

Right Join

In [7]:
cursor.execute("SELECT Student.*, Course.course_name FROM Course LEFT JOIN Student ON Student.course_id = Course.id;")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(None, None, None, None, None, 'Tin hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')

Full Outer Join

In [8]:
cursor.execute("SELECT Student.*, Course.course_name FROM Student LEFT JOIN Course ON Student.course_id = Course.id UNION SELECT Student.*, Course.course_name FROM Course LEFT JOIN Student ON Student.course_id = Course.id;")
rows = cursor.fetchall()
for row in rows:
    print(row)

(None, None, None, None, None, 'Tin hoc')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 'Giai tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 'Thong ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 'Thong ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None)

In [9]:
cursor.execute("UPDATE Student SET course_id = (SELECT MIN(id) FROM Course) WHERE course_id IS NULL")
cursor.execute("DELETE FROM Student WHERE course_id NOT IN (SELECT id FROM Course)")
cursor.execute("select * from Student")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(3, 'Pham Van Nam', 'Toan Tin', 12, 7.9)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(9, 'Duong Huu Phuc', 'Kinh Te', 12, 7.2)
(10, 'Cao Thi Hanh', 'May Tinh', 12, 7.0)

In [10]:
# Truy vấn tổng số sinh viên và điểm trung bình của từng lớp
cursor.execute("SELECT class, COUNT(student_id) AS total_students, AVG(score) AS average_score FROM Student GROUP BY class")
print("\nTổng số sinh viên và điểm trung bình của từng lớp:")
rows = cursor.fetchall()
for row in rows:
    print(row)

Tổng số sinh viên và điểm trung bình của từng lớp:
('Kinh Te', 3, 8.533333333333333)
('May Tinh', 2, 6.85)
('Toan Tin', 1, 7.9)

In [11]:
# Phân loại thi đua theo điểm trung bình của từng môn học
cursor.execute("SELECT course_id, AVG(score) AS average_score, 
                CASE 
                    WHEN AVG(score) >= 9.0 THEN 'Xuất sắc' 
                    WHEN AVG(score) >= 6.0 THEN 'Tốt' 
                    ELSE 'Kém' 
                END AS classification 
                FROM Student GROUP BY course_id")
print("\nPhân loại thi đua theo điểm trung bình của từng môn học:")
rows = cursor.fetchall()
for row in rows:
    print(row)

# Lưu thay đổi và đóng kết nối
conn.commit()
conn.close()

print("\nDữ liệu đã được cập nhật và hiển thị thành công từ SQLite!")

SyntaxError: EOL while scanning string literal (618036766.py, line 2)

In [ ]:
#3
students = cursor.fetchall()
for student in students:
    print(student)

# Xếp hạng sinh viên theo điểm số chung
print("\nTop 3 sinh viên có điểm cao nhất:")
print("\nTop 3 sinh viên có điểm cao nhất:")
cursor.execute("""
    SELECT student_id, name, score 
    FROM Student 
    ORDER BY score DESC 
    LIMIT 3
""")
print(cursor.fetchall())

Top 3 sinh viên có điểm cao nhất:

Top 3 sinh viên có điểm cao nhất:
[(2, 'Tran Thi Lan', 9.2), (7, 'Bui Tien Dung', 9.2), (3, 'Pham Van Nam', 7.9)]

In [13]:
print("\nTop 3 sinh viên có điểm thấp nhất:")
cursor.execute("""
    SELECT student_id, name, score 
    FROM Student 
    ORDER BY score ASC 
    LIMIT 3
""")
print(cursor.fetchall())

Top 3 sinh viên có điểm thấp nhất:
[(1, 'Nguyen Minh Hoang', 6.7), (10, 'Cao Thi Hanh', 7.0), (9, 'Duong Huu Phuc', 7.2)]

In [14]:
# Xếp hạng sinh viên theo lớp học
print("\nTop 3 sinh viên có điểm cao nhất trong từng lớp:")
cursor.execute("""
    SELECT student_id, name, class, score 
    FROM (
        SELECT student_id, name, class, score, 
               RANK() OVER (PARTITION BY class ORDER BY score DESC) AS rank_high 
        FROM Student
    ) WHERE rank_high <= 3
""")
print(cursor.fetchall())

Top 3 sinh viên có điểm cao nhất trong từng lớp:
[(2, 'Tran Thi Lan', 'Kinh Te', 9.2), (7, 'Bui Tien Dung', 'Kinh Te', 9.2), (9, 'Duong Huu Phuc', 'Kinh Te', 7.2), (10, 'Cao Thi Hanh', 'May Tinh', 7.0), (1, 'Nguyen Minh Hoang', 'May Tinh', 6.7), (3, 'Pham Van Nam', 'Toan Tin', 7.9)]

In [15]:
print("\nTop 3 sinh viên có điểm thấp nhất trong từng lớp:")
cursor.execute("""
    SELECT student_id, name, class, score 
    FROM (
        SELECT student_id, name, class, score, 
               RANK() OVER (PARTITION BY class ORDER BY score ASC) AS rank_low 
        FROM Student
    ) WHERE rank_low <= 3
""")
print(cursor.fetchall())

Top 3 sinh viên có điểm thấp nhất trong từng lớp:
[(9, 'Duong Huu Phuc', 'Kinh Te', 7.2), (2, 'Tran Thi Lan', 'Kinh Te', 9.2), (7, 'Bui Tien Dung', 'Kinh Te', 9.2), (1, 'Nguyen Minh Hoang', 'May Tinh', 6.7), (10, 'Cao Thi Hanh', 'May Tinh', 7.0), (3, 'Pham Van Nam', 'Toan Tin', 7.9)]

In [16]:
# Xếp hạng sinh viên theo môn học
print("\nTop 3 sinh viên có điểm cao nhất trong từng môn học:")
cursor.execute("""
    SELECT student_id, name, course_id, score 
    FROM (
        SELECT student_id, name, course_id, score, 
               RANK() OVER (PARTITION BY course_id ORDER BY score DESC) AS rank_high 
        FROM Student
    ) WHERE rank_high <= 3
""")
print(cursor.fetchall())

Top 3 sinh viên có điểm cao nhất trong từng môn học:
[(3, 'Pham Van Nam', 12, 7.9), (9, 'Duong Huu Phuc', 12, 7.2), (10, 'Cao Thi Hanh', 12, 7.0), (2, 'Tran Thi Lan', 34, 9.2), (7, 'Bui Tien Dung', 34, 9.2)]

In [17]:
print("\nTop 3 sinh viên có điểm thấp nhất trong từng môn học:")
cursor.execute("""
    SELECT student_id, name, course_id, score 
    FROM (
        SELECT student_id, name, course_id, score, 
               RANK() OVER (PARTITION BY course_id ORDER BY score ASC) AS rank_low 
        FROM Student
    ) WHERE rank_low <= 3
""")
print(cursor.fetchall())

Top 3 sinh viên có điểm thấp nhất trong từng môn học:
[(1, 'Nguyen Minh Hoang', 12, 6.7), (10, 'Cao Thi Hanh', 12, 7.0), (9, 'Duong Huu Phuc', 12, 7.2), (2, 'Tran Thi Lan', 34, 9.2), (7, 'Bui Tien Dung', 34, 9.2)]

In [21]:
#4
import datetime

# Kiểm tra xem cột graduation_date đã tồn tại chưa
cursor.execute("PRAGMA table_info(Student)")
columns = [col[1] for col in cursor.fetchall()]
if "graduation_date" not in columns:
    cursor.execute("""
    ALTER TABLE Student ADD COLUMN graduation_date DATETIME
    """)

# Lấy danh sách sinh viên sắp xếp theo điểm số giảm dần
cursor.execute("SELECT student_id, score FROM Student ORDER BY score DESC")
students = cursor.fetchall()

# Xác định ngày tốt nghiệp dựa trên thứ hạng (thêm số ngày bằng thứ hạng vào ngày hiện tại)
current_date = datetime.datetime.now()
for rank, (student_id, score) in enumerate(students, start=1):
    graduation_date = current_date + datetime.timedelta(days=rank)
    cursor.execute("UPDATE Student SET graduation_date = ? WHERE student_id = ?", (graduation_date, student_id))

# Lưu thay đổi và đóng kết nối
conn.commit()


print("\nĐã cập nhật ngày tốt nghiệp cho sinh viên dựa trên thứ hạng theo điểm số!")
cursor.execute("select * from Student")
rows = cursor.fetchall()
for row in rows:
    print(row)

Đã cập nhật ngày tốt nghiệp cho sinh viên dựa trên thứ hạng theo điểm số!
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, '2025-03-19 22:36:20.602045')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, '2025-03-14 22:36:20.602045')
(3, 'Pham Van Nam', 'Toan Tin', 12, 7.9, '2025-03-16 22:36:20.602045')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, '2025-03-15 22:36:20.602045')
(9, 'Duong Huu Phuc', 'Kinh Te', 12, 7.2, '2025-03-17 22:36:20.602045')
(10, 'Cao Thi Hanh', 'May Tinh', 12, 7.0, '2025-03-18 22:36:20.602045')